_posts/2016-11-1-solving-ml-problems.html
---
layout: post
title: "How to solve ml problems"
date: 2016-11-01
comments: true
archive: false
tags: solving-ml-problems
excerpt: How to solve ml problems
---

<p>
<b>Solving ML problems</b>
</p>


<ol class="org-ol">
<li>Identify the problem</li>
<li>Identify the impact of the problem</li>
<li>Identify the methodology to solve the problem</li>
</ol>


<ol class="org-ol">
<li><p>
Defining the problem. There exist different ways to do that.
</p>

<p>
<code>Informal description</code>
</p>

<p>
Describe the problem as though you were describing it to a friend or
colleague. This can provide a great starting point for highlighting
areas that you might need to fill. It also provides the basis for a
one sentence description you can use to share your understanding of
the problem.
</p>

<p>
For example: I need a program that will tell me which tweets will get
retweets.
</p>

<ul class="org-ul">
<li>Formalism</li>
</ul>
<p>
Here's a good example from Tom Mitchell’s machine learning formalism.
</p>

<p>
A computer program is said to learn from experience <code>E</code> with respect
to some class of tasks <code>T</code> and performance measure <code>P</code>, if its
performance at tasks in <code>T</code>, as measured by <code>P</code>, improves with
experience <code>E</code>.
</p>

<p>
Use the above formalism to define the T, P, and E for our problem.
</p>

<p>
For example:
</p>

<ul class="org-ul">
<li>Task (T): Classify a tweet that has not been published as going to
get retweets or not.</li>

<li>Experience (E): A corpus of tweets for an account where some have
retweets and some do not.</li>

<li><p>
Performance (P): Classification accuracy, the number of tweets
predicted correctly out of all tweets considered as a percentage.
</p>

<p>
<code>Assumptions</code>
</p>

<p>
Create a list of assumptions about the problem and it’s
phrasing. These may be rules of thumb and domain specific information
that you think will get you to a viable solution faster.
</p>

<p>
It can be useful to highlight questions that can be tested against
real data because breakthroughs and innovation occur when assumptions
and best practice are demonstrated to be wrong in the face of real
data. It can also be useful to highlight areas of the problem
specification that may need to be challenged, relaxed or tightened.
</p>

<p>
For example:
</p>

<p>
The specific words used in the tweet matter to the model.  The
specific user that retweets does not matter to the model.  The number
of retweets may matter to the model.  Older tweets are less predictive
than more recent tweets.
</p>

<p>
<code>Similar problems</code>
</p>

<p>
What other problems have you seen or can you think of that are like
the problem you are trying to solve? Other problems can inform the
problem you are trying to solve by highlighting limitations in your
phrasing of the problem such as time dimensions and conceptual drift
(where the concept being modeled changes over time). Other problems
can also point to algorithms and data transformations that could be
adopted to spot check performance.
</p>

<p>
For example: A related problem would be email spam discrimination that
uses text messages as input data and needs binary classification
decision.
</p></li>
</ul></li>

<li><p>
Why does the the problem need to be solved?
</p>

<p>
The second step is to think deeply about why you want or need the
problem solved.
</p>

<ul class="org-ul">
<li><p>
Motivation
</p>

<p>
Consider your motivation for solving the problem. What need will be
fulfilled when the problem is solved?
</p>

<p>
For example, you may be solving the problem as a learning
exercise. This is useful to clarify as you can decide that you don’t
want to use the most suitable method to solve the problem, but instead
you want to explore methods that you are not familiar with in order to
learn new skills.
</p>

<p>
Alternatively, you may need to solve the problem as part of a duty at
work, ultimately to keep your job.
</p></li>

<li><p>
Solution Benefits
</p>

<p>
Consider the benefits of having the problem solved. What capabilities
does it enable?
</p>

<p>
It is important to be clear on the benefits of the problem being
solved to ensure that you capitalize on them. These benefits can be
used to sell the project to colleagues and management to get buy in
and additional time or budget resources.
</p>

<p>
If it benefits you personally, then be clear on what those benefits
are and how you will know when you have got them. For example, if it’s
a tool or utility, then what will you be able to do with that utility
that you can’t do now and why is that meaningful to you?
</p></li>

<li><p>
Solution Use
</p>

<p>
Consider how the solution to the problem will be used and what type of
lifetime you expect the solution to have. As programmers we often
think the work is done as soon as the program is written, but really
the project is just beginning it’s maintenance lifetime.
</p>

<p>
The way the solution will be used will influence the nature and
requirements of the solution you adopt.
</p>

<p>
Consider whether you are looking to write a report to present results
or you want to operationalize the solution. If you want to
operationalize the solution, consider the functional and nonfunctional
requirements you have for a solution, just like a software project.
</p></li>
</ul></li>

<li><p>
How would I solve the problem?
</p>

<p>
In this third and final step of the problem definition, explore how
you would solve the problem manually.
</p>

<p>
List out step-by-step what data you would collect, how you would
prepare it and how you would design a program to solve the
problem. This may include prototypes and experiments you would need to
perform which are a gold mine because they will highlight questions
and uncertainties you have about the domain that could be explored.
</p>

<p>
This is a powerful tool. It can highlight problems that actually can
be solved satisfactorily using a manually implemented solution. It
also flushes out important domain knowledge that has been trapped up
until now like where the data is actually stored, what types of
features would be useful and many other details.
</p>

<p>
Collect all of these details as they occur to you and update the
previous sections of the problem definition. Especially the
assumptions and rules of thumb.
</p>

<p>
We have considered a manually specified solution before when
describing complex problems in why machine learning matters.
</p>

<ul class="org-ul">
<li>Summary</li>
</ul></li>
</ol>


<p>
In this post we've discussed the value of being clear on the
problem you are solving. You discovered a three step framework
for defining your problem with practical tactics at at step:
</p>

<ol class="org-ol">
<li>What is the problem? Describe the problem informally and
formally and list assumptions and similar problems.</li>

<li>Why does the problem need to be solve? List your motivation
for solving the problem, the benefits a solution provides and
how the solution will be used.</li>

<li>How would I solve the problem? Describe how the problem would
be solved manually to flush domain knowledge.</li>
</ol>

<p>
<a href="http://machinelearningmastery.com/practical-machine-learning-problems/">   Link</a>
</p>
